foamCases/newMesh0/meshTest/teste2/system/average
fieldAverage1
{
    type fieldAverage;
    libs ("libfieldFunctionObjects.so");
//    restartOnRestart    false;
//    restartOnOutput     false;
//    periodicRestart     false;
//    restartPeriod       0.002;
	writeControl	writeTime;
    fields
    (
        U
        {
//            writeFields	    false;
	    mean            on;
            prime2Mean      off;
            base            time;
            //window          10.0;
            //windowName      w1;
        }
        p
        {
            mean            off;
            prime2Mean      off;
            base            time;
        }
    );
}
